import React from 'react';

import styles from '../index.module.scss';

interface ShipmentProps {
	lang: string
}

export const Shipment: React.FC<ShipmentProps> = ({ lang }) => {
	return <div className={styles['static-page']}>
		{ lang === 'ua' ? <>
			<h3>Доставка товару по всій Україні здійснюється транспортною компанією Нова Пошта</h3>
			<ul>
				<li>на відділення нової пошти</li>
				<li>на адресу кур'єром нової пошти (вартість доставки не змінюється)</li>
				<li>самовивіз зі складу</li>
			</ul>
			<h3>Термін доставка в середньому складає 1-3 дні.</h3>
			<p className='ml-8'>*більш точний термін відправки та доставки товару можете уточнити у менеджера інтернет-магазину.</p>
			<h3>Вартість доставки складає від 70 грн.</h3>
			<p className='ml-8'>*вартість доставки товару можна прорахувати на сторінці товару або у менеджера інтернет-магазину.</p>
		</> : <>
			<h3>Доставка товара по всей Украине осуществляется транспортной компанией Новая Почта</h3>
			<ul>
				<li>на отделение новой почты</li>
				<li>на адрес курьером новой почты (стоимость доставки не меняется)</li>
				<li>самовывоз со склада</li>
			</ul>
			<h3>Срок доставки в среднем составляет 1-3 дня.</h3>
			<p className='ml-8'>*более точный срок отправки и доставки товара можете уточнить у менеджера интернет-магазина.</p>
			<h3>Стоимость доставки составляет от 70 грн.</h3>
			<p className='ml-8'>*стоимость доставки товара можно просчитать на странице товара или у менеджера интернет-магазина.</p>
		</>}
	</div>
}
