import React from 'react';

import styles from '../index.module.scss';

interface AboutUsProps {
	lang: string
}

export const AboutUs: React.FC<AboutUsProps> = ({ lang }) => {
	return <div className={styles['static-page']}>
		{ lang === 'ua' ? <>
			<h3>Вітаємо Вас у інтернет магазині автомобільних шин та дисків Люксшина.</h3>
			<p>Ми пропонуємо великий вибір високоякісних шин та дисків для Вашого автомобіля, незалежно від марки, моделі чи
				стилю водіння. Наш магазин - це місце, де стиль, безпека і ефективність зустрічаються з інноваційними рішеннями
				та найкращими цінами.</p>
			<p>Чому саме Люксшина?</p>
			<p>Розширений асортимент: У нас є шини та диски для всіх типів автомобілів - від маленьких сімейних авто до
				вантажівок та комбайнів. Ви можете бути впевнені, що знайдете відповідні товари для Вашого транспортного
				засобу.</p>
			<p>Якість та надійність: Ми співпрацюємо з найкращими виробниками шин та дисків, гарантуючи вам продукцію високої
				якості, яка відповідає всім стандартам безпеки та ефективності.</p>
			<p>Експертна консультація: Наші кваліфіковані фахівці завжди готові допомогти вам обрати правильні шини та диски
				для вашого автомобіля. Ми враховуємо Ваші індивідуальні потреби та бюджет.</p>
			<p>Зручність покупок: Ми піклуємося про Ваш комфорт. Наш сайт простий у використанні, зі швидким пошуком і легким
				оформленням замовлення. Ви можете замовити товари онлайн або зателефонувавши нам і вибрати зручний варіант
				доставки.</p>
			<p>Гарантія та обслуговування: Ми стоїмо за якість наших товарів. У нас є гарантійні умови та можливість
				обслуговування, щоб ви були повністю задоволені своїми покупками.</p>
			<p>Не зволікайте! Оберіть якість і безпеку для свого автомобіля у магазині Люксшина. Перегляньте наш асортимент
				прямо зараз та зробіть перший крок до безпечної та комфортної їзди.</p>
			<p>Ми завжди готові Вас вітати в інтернет магазині Люксшина - Ваш надійний партнер!</p>
		</> : <>
			<h3>Добро пожаловать в интернет магазине автомобильных шин и дисков Люксшина.</h3>
			<p>Мы предлагаем большой выбор высококачественных шин и дисков для Вашего автомобиля, независимо от марки, модели
				или стиля вождения. Наш магазин – это место, где стиль, безопасность и эффективность встречаются с
				инновационными
				решениями и лучшими ценами.</p>
			<p>Почему именно Люксшина?</p>
			<p>Расширенный ассортимент: У нас есть шины и диски для всех типов автомобилей – от маленьких семейных авто до
				грузовиков и комбайнов. Вы можете быть уверены, что найдете подходящие товары для вашего транспортного
				средства.</p>
			<p>Качество и надежность: Мы сотрудничаем с лучшими производителями шин и дисков, гарантируя вам продукцию
				высокого
				качества, отвечающую всем стандартам безопасности и эффективности.</p>
			<p>Экспертная консультация: Наши квалифицированные специалисты всегда готовы помочь Вам выбрать правильные диски и
				шины для Вашего автомобиля. Мы учитываем Ваши индивидуальные потребности и бюджет.</p>
			<p>Удобство покупок: Мы заботимся о Вашем комфорте. Наш сайт прост в использовании с быстрым поиском и легким
				оформлением заказа. Вы можете заказать товары онлайн или позвонив нам и выбрать удобный вариант доставки.</p>
			<p>Гарантия и обслуживание: Мы следим за качество наших товаров. У нас есть гарантийные условия и возможность
				обслуживания, чтобы Вы были полностью удовлетворены покупками.</p>
			<p>Не медлите! Выберите качество и безопасность своего автомобиля в магазине Люксшина. Просмотрите наш ассортимент
				прямо сейчас и сделайте первый шаг к безопасной и комфортной езде.</p>
			<p>Мы всегда рады Вас приветствовать в интернет магазине Он-тайэрс – Ваш надежный партнер!</p>
		</>}
	</div>
}
