import React from 'react';

import styles from '../index.module.scss';

interface PaymentProps {
	lang: string
}

export const Payment: React.FC<PaymentProps> = ({ lang }) => {
	return <div className={styles['static-page']}>
		{ lang === 'ua' ? <>
			<h3>Готівкою</h3>
			<p>*при отримані товару на віділенні транспортної компанії (накладений платіж) або у точці видачі, розрахунок
				відбувається у національній валюті.</p>
			<h3>Оплата картою</h3>
			<p>*після оформлення замовлення, менеджер магазину висилає номер карти, зручним для Вас спосібом.</p>
			<h3>Оплата по реквізитам</h3>
			<p>*після оформлення замовлення, менеджер магазину висилає реквізити, зручним для Вас спосібом.</p>
			<h3>Безготівковим розрахунком</h3>
			<p>*після оформлення замовлення, менеджер магазину зручним для Вас спосібом висилає рахунок-фактуру з ПДВ або без
				ПДВ.</p>
			<p>*даний рахунок можна оплатити через додаток, касу, термінал або іншим зручним для Вас спосібом.</p>
			<h3>Кредит від Нової Пошти (NovaPay)</h3>
			<p>*Ви можете оформити кредит на відділенні Нової Пошти, після огляду товару.</p>
			<h3>Умови:</h3>
			<p>Сума – від 1000 до 100000 грн.</p>
			<p>Строк – 12 місяців</p>
			<p>Комісія – 3,5% на місяць</p>
			<p>Без першого внеску</p>
			<h3>Приклад:</h3>
			<p>При замовленні товару на 10 тис, щомісячний платіж на 12 місяців становитиме 833,33 грн + 3,5% (350 грн) =
				1083,33 грн.</p>
			<p>Разом, переплата 12*3,5% (350 грн) = 4200 грн. При достроковому погашенні, переплата буде меншою</p>
			<p>Детальніше у будь-якому відділенні Нової Пошти або на офіційному сайті <a
				href="https://novapay.ua/credit/">NovaPay</a></p>
		</> : <>
			<h3>Наличными</h3>
			<p>*при получении товара на отделении транспортной компании (наложенный платеж) или в точке выдачи, расчет
				производится в национальной валюте.</p>
			<h3>Оплата картой</h3>
			<p>*после оформления заказа менеджер магазина высылает номер карты, удобным для Вас способом.</p>
			<h3>Оплата по реквизитам</h3>
			<p>*после оформления заказа менеджер магазина высылает реквизиты, удобным для Вас способом.</p>
			<h3>Безналичным расчёт</h3>
			<p>*после оформления заказа менеджер магазина удобным для Вас способом высылает счет-фактуру с НДС или без
				НДС.</p>
			<p>*данный счет можно оплатить через приложение, кассу, терминал или другим удобным для Вас способом.</p>
			<h3>Кредит от Новой Почты (NovaPay)</h3>
			<p>*Вы можете оформить кредит на отделении Новой Почты, после осмотра товара.</p>
			<h3>Условия:</h3>
			<p>Сумма – от 1 000 до 100 000 грн.</p>
			<p>Срок – 12 месяцев</p>
			<p>Комиссия – 3,5% в месяц</p>
			<p>Без первого вноса</p>
			<h3>Пример:</h3>
			<p>При заказе товара на 10 тыс, ежемесячный платеж на 12 месяцев будет составлять 833,33 грн + 3,5% (350 грн) =
				1083,33 грн.</p>
			<p>Итого, переплата 12*3,5% (350 грн) = 4200 грн. При досрочном погашении, переплата будет меньше</p>
			<p>Подробнее в любом отделении Новой Почты или на официальном сайта <a
				href="https://novapay.ua/credit/">NovaPay</a></p>
		</>}
	</div>
}
